Repository: lustre/lustre-release
Catalog: lustre/kernel_patches/quilt/po/*.po
Languages: de, fr

source: Removing $patch
de: Entferne $patch
fr: Retrait de $patch

source: Failed to create temporary files
de: Konnte temporäres Verzeichnis nicht erstellen
fr: Impossible de créer les fichiers temporaires

source: Patch $patch does not remove (enforce with -f)
de: Patch $patch kann nicht entfernt werden (erzwingen mit -f)
fr: Le patch $patch ne se retire pas proprement (forcez avec -f)

source: done
de: fertig
fr: fini

source: Apply patch(es) from the series file. A number of patches to apply, or a patch name can be specified. If a patch name is given, apply all patches up to and including the named patch. If neither a number nor a patch name is specified, apply the next patch from the series file. -a Apply all patches in the series file. -f Force apply, even if the patch has rejects. -q Quiet operation. -v Verbose operation. --leave-rejects Leave around the reject files patch produced, even if the patch is not actually applied. --interactive Allow the patch utility to ask how to deal with conflicts. If this option is not given, the option -f will be passed to the patch program.
fr: Applique un ou plusieurs patches de la série. Il est possible de donner en argument un nombre de patch à appliquer ou un nom de patch. Dans ce dernier cas, tous les patches placés au dessous du patch à retirer seront appliqués eux aussi. Si aucun argument n'est spécifié, le prochain patch est appliqué. -a Applique tous les patches de la série. -f Force l'application, même si cela doit produire des rejets. -q Opère silencieusement. -v Opère verbeusement. --leave-rejects Laisse les fichiers de rejets produits, même si l'application du patch a échoué et qu'il n'est finalement pas appliqué. --interactive Laisse l'utilitaire patch demander comment résoudre les conflits. Si cette option n'est pas donnée, l'option -f sera passée au programme patch.
