Repository: lustre/lustre-release
Catalog: lustre/kernel_patches/quilt/po/*.po
Languages: de, fr

source: Usage: quilt command [-h] ...
de: Verwendung: quilt befehl [-h] ...
fr: Usage : quilt commande [-h] ...

source: Commands are:
de: Folgende Befehle gibt es:
fr: Les commandes sont :

source: Usage: quilt add [-p patch] {file} ...
de: Verwendung: quilt add [-p patch] {datei} ...
fr: Usage : quilt add [-p patch] {fichier} ...

source: Add one or more files to the topmost or named patch. Files must be added to the patch before being modified. Files that are modified by patches on top of the specified patch cannot be added. -p patch Patch to add files to.
de: Fügt eine oder mehrere Dateien zum obersten oder angegebenen Patch hinzu. Dateien müssen einem Patch hinzugefügt werden, bevor sie verändert werden. Dateien können einem Patch nur hinzugefügt werden, solange sie von keinem Patch höher auf dem Stapel verändert werden. -p patch Der Patch, zu dem die Dateien hinzugefügt werden sollen.
fr: Ajoute un ou plusieurs fichiers au patch indiqué ou à celui au sommet. Les fichiers doivent être ajoutés au patch avant toute modification. Les fichiers modifiés par d'autres patches plus haut dans la pile ne peuvent pas être ajoutés. -p patch Patch auquel les fichiers doivent être ajoutés.

source: No patch applied
de: Kein Patch angewandt
fr: Aucun patch n'est appliqué

source: Patch $patch is not applied
de: Patch $patch ist nicht angewandt
fr: Le patch $patch n'est pas appliqué

source: File $file is already in patch $patch
de: Datei $file ist bereits in Patch $patch enthalten
fr: Le fichier $file est déjà dans le patch $patch

source: File $file modified by patch $next_patch
de: Datei $file wird von Patch $next_patch verändert
fr: Le fichier $file est modifié par le patch $next_patch

source: Failed to back up file $file
de: Konnte Datei $file nicht sichern
fr: Impossible de faire une copie de sécurité de $file

source: File $file added to patch $patch
de: Datei $file zu Patch $patch hinzugefügt
fr: Le fichier $file a été ajouté au patch $patch

source: Usage: quilt delete [patch]
de: Verwendung: quilt delete [patch]

source: Remove the specified or topmost patch from the series file. If the patch is applied, quilt will attempt to remove it first. (Only the topmost patch can be removed right now.)
de: Löscht den obersten oder angegebenen Patch aus der series-Datei. Falls dieser Patch angewandt ist, entfernt quilt ihn zuerst. (Momentan kann nur der oberste Patch entfernt werden.)
fr: Efface le patch spécifié (ou celui au sommet de la pile) de la série actuelle. Si le patch est appliqué, quilt tentera de le retirer avant. (Seul le patch au sommet peut être retiré pour l'instant).

source: Patch $patch does not exist
de: Patch $patch existiert nicht
fr: Le patch $patch n'existe pas

source: Patch $patch is currently applied
de: Patch $patch ist momentan angewandt
fr: Le patch $patch est appliqué

source: Failed to remove patch $patch
de: Konnte Patch $patch nicht entfernen
fr: Impossible de retirer le patch $patch

source: Usage: quilt diff [-p n] [-c patch|-z] [-R] [-P patch] [file ...]
de: Verwendung: quilt diff [-p n] [-c patch|-z] [-R] [-P patch] [datei ...]
fr: Usage : quilt diff [-p n] [-c patch|-z] [-R] [-P patch] [fichier ...]

source: Options \`-c patch' and \`-z' cannot be combined.
de: Die Optionen \`-c patch' and \`-z' können nicht kombiniert werden.
fr: Les options \`-c patch' et \`-z' ne peuvent pas être combinées.

source: No patch seem to be applied
de: Es ist kein Patch angewandt
fr: Aucun patch ne semble appliqué

source: Patch $last_patch is not applied
de: Patch $last_patch ist nicht angewandt
fr: Le patch $last_patch ne semble pas appliqué

source: Cannot diff patches with -p$opt_strip_level, please specify -p0 or -p1 instead
de: Kann kein Diff mit -p$opt_strip_level erzeugen, bitte -p0 oder -p1 verwenden.
fr: Impossible de créer des patches avec -p$opt_strip_level. Veuillez spécifier -p0 ou -p1 à la place

source: refresh_patches_per_file failed.
de: Fehler in refresh_patches_per_file.
fr: refresh_patches_per_file a échoué.

source: Patch $opt_combine not applied before $last_patch.
de: Patch $opt_combine ist nicht vor Patch $last_patch angewandt.
fr: Le patch $opt_combine n'est pas appliqué avant $last_patch.

source: File $file is not being modified.
de: Datei $file wird nicht verändert.
fr: Le fichier $file n'est pas modifié.

source: Cannot change into .pc/$last_patch
de: Kann nicht in Verzeichnis .pc/$last_patch wechseln.
fr: Impossible d'entrer dans .pc/$last_patch

source: Failed to copy files to temporary directory
de: Konnte Dateien nicht in ein temporäres Verzeichnis kopieren
fr: Impossible de copier les fichiers dans le répertoire temporaire

source: Cannot change to temporary directory
de: Kann nicht in temporäres Verzeichnis wechseln
fr: Impossible d'entrer dans le répertoire temporaire

source: Failed to patch temporary files
de: Konnte temporäre Dateien nicht patchen
fr: Impossible de patcher les fichiers temporaires

source: Cannot change to source directory
de: Kann nicht in Quellverzeichnis wechseln
fr: Impossible d'entrer dans le répertoire source

source: Diff failed, aborting.
de: Diff fehlgeschlagen, Abbruch.
fr: Le diff a échoué. Abandon.

source: More recent patches modify files in $last_patch.
de: Später angewandte Patches verändern Dateien von $last_patch.
fr: Un patch plus recent modifie des fichiers communs à $last_patch.

source: Usage: quilt files [-v] [patch]
de: Verwendung: quilt files [-v] [patch]

source: Print the list of files that the topmost or specified patch changes. -v Verbose, more user friendly output.
de: Gibt eine Liste der Dateien aus, die der oberste oder angegebene Patch beinhaltet. -v Ausführlichere, benutzerfreundliche Ausgabe.
fr: Affiche la liste des fichiers modifiés par le patch spécifié (ou celui au sommet). -v Affichage verbeux, plus simple à lire.

source: Patch is not applied (no verbose output)
de: Patch ist nicht angewandt (keine ausführliche Ausgabe)
fr: Le patch n'est pas appliqué (affichage non verbeux)

source: Patch is not applied
de: Patch ist nicht angewandt
fr: Le patch n'est pas appliqué

source: Usage: quilt import [-f] [-p num] [-n patch] [patchfile]
de: Verwendung: quilt import [-f] [-p num] [-n patch] [patchdatei]
fr: Usage : quilt import [-f] [-p num] [-n patch] [fichier_de_patch]

source: Import an external patch. If a patch file name is specified, the patch will be stored in this relative path in the patches/ directory. Else, if an input file name is given this name is used as the patch name. -p num Number of directory levels to strip when aplying (default=1) -n patch File name relative to patches/ to use. -f Overwite/update existing patches.
de: Importiert einen Patch aus einer Datei. Ist ein Patch-Dateiname angegeben, so wird er Patch in diesem Pfad relativ zum patches/-Verzeichnis abgelegt. Sonst wird (wenn angegeben) der Patch-Dateiname verwendet. -p num Anzahl der Verzeichnisebenen, die beim Anwenden des Patches entfernt werden (Standardwert=1) -n patch Patch-Dateiname relativ zum patches/-Verzeichnis. -f Bestehende Patches überschreiben/aktualisieren.
fr: Importe un patch externe. Si le nom de fichier spécifié est un chemin, il est relatif au répertoire patches/. Si aucun nom de fichier n'est donné, le patch sera stocké dans un fichier du même nom que le fichier d'entrée. -p num Nombre de niveaux de répertoires à retirer lors de l'application du patch (1 par défaut). -n patch Nom de fichier (relatif à patches/) à utiliser. -f Écrase/met à jour les patchs existants.

source: Please use -n to specify a patch file name.
de: Bitte -n verwenden, um einen Patch-Namen anzugeben.
fr: Veuillez utiliser -n pour spécifier un nom de fichier de patch.

source: Patch file name \"$patch_file\" contains whitespace.
de: Patch-Dateiname \"$patch_file\" enthält Leerstellen.
fr: Le nom de fichier de patch "$patch_file" contient des espaces.

source: Patch $patch is applied.
de: Patch $patch ist angewandt.
fr: Le patch $patch est appliqué.

source: Cannot read from standard input.
de: Kann nicht von der Standardeingabe lesen.
fr: Impossible de lire depuis l'entrée standard.

source: Cannot decompress file $input_file
de: Kann Datei $input_file nicht dekomprimieren
fr: Impossible de décompresser le fichier $input_file

source: Cannot read from file $input_file
de: Kann nicht von Datei $input_file lesen
fr: Impossible de lire depuis le fichier $input_file

source: Patch $patch exists. Replace with -f.
de: Patch $patch existiert bereits. Ersetzen mit -f.
fr: Le patch $patch existe. Utilisez -f pour le remplacer.

source: Updating %patch section of patch $patch
de: Aktualisiere %patch-Abschnitt von Patch $patch
fr: Mise à jour de la section %patch dans $patch

source: Failed to update %patch section of patch $patch
de: Konnte %patch-Abschnitt in Patch $patch nicht aktualisieren
fr: Impossible de mettre à jour la section %patch du patch $patch

source: Replacing patch $patch with new version
de: Ersetze Patch $patch durch neuere Version
fr: Remplacement du patch $patch avec la nouvelle version

source: Failed to replace patch $patch
de: Konnte Patch $patch nicht ersetzen
fr: Impossible de remplacer le patch $patch

source: Importing patch $patch (stored as $patch_file)
de: Importiere Patch $patch (abgelegt als $patch_file)
fr: Import du patch $patch (enregistré dans $patch_file)

source: Failed to import patch $patch
de: Konnte Patch $patch nicht importieren
fr: Impossible d'importer le patch $patch

source: Failed to insert $patch in file series.
de: Konnte Patch $patch nicht in die series-Datei einfügen.
fr: Impossible d'inserer $patch dans le fichier de série.

source: Usage: quilt new {patchname}
de: Verwendung: new {patchname}
fr: Usage : quilt new {nom_de_patch}

source: Create a new patch with the specified file name, and insert it after the topmost patch in the patch series file.
de: Erzeugr einen neuen Patch mit dem angegebenen Dateinamen, und fügt ihn nach dem obersten Patch in die series-Datei ein.
fr: Crée un nouveau patch au nom spécifié, et l'insere après le patch au sommet dans le fichier de série.

source: Patch $patch exists already
de: Patch $patch existiert bereits
fr: Le patch $patch existe déjà

source: Failed to create patch $patch
de: Konnte Patch $patch nicht erzeugen
fr: Impossible de crée le patch $patch

source: Patch $patch is now on top
de: Der oberste Patch ist jetzt $patch
fr: Le patch $patch est maintenant au sommet

source: Usage: quilt next [patch]
de: Verwendung: quilt next [patch]

source: Print the name of the next patch after the specified or topmost patch in the series file. -n Print patch file names instead of patch names.
de: Gibt den Namen des nächsten Patches nach dem obersten oder angegebenen Patch in der series-Datei aus. -n Patch-Dateinamen statt Patch-Namen ausgeben.
fr: Affiche le nom du patch après celui spécifié (ou après celui au sommet) dans le fichier de série. -n Affiche le nom de fichier au lieu du nom de patch.

source: Usage: quilt patches {file}
de: Verwendung: quilt patches {file}
fr: Usage : quilt patches {fichier}

source: Print the list of patches that modify the specified file. -n Print the patch file names instead of the patch names. -v Verbose, more user friendly output.
de: Gibt die Liste der Patches aus, die die angegebene Datei verändern. -n Patch-Dateinamen statt Patch-Namen ausgeben. -v Ausführlichere, benutzerfreundliche Ausgabe.
fr: Affiche la liste des patches modifiant le fichier spécifié. -n Affiche les noms de fichier au lieu des noms de patch. -v Affichage verbeux, plus simple à lire.

source: Usage: quilt pop [-afRqv] [num|patch]
de: Verwendung: quilt pop [-afRqv] [num|patch]

source: Remove patch(es) from the current stack. A number of patches to remove, or a patch name can be specified. If a patch name is given, remove all patches applied on top of the named patch. If neither a number nor a patch name is specified, remove the next patch from the series file. -a Remove all applied patches. -f Force remove. The state before the patch(es) were applied will be restored from backup files. -R Remove the patch with \`patch -R' and check if the patch reverts all changes properly. -q Quiet operation. -v Verbose operation.
de: Entfernt Patches vom Stapel. Es kann eine Anzahl von Patches, die entfernt werden soll, oder der Name eines Patches angegeben werden. Wenn ein Name angegeben wird, werden alle Patches über dem angegebenen Patch entfernt. Wenn weder ein Patchname noch eine Nummer angegeben wird, wird der oberste Patch entfernt. -a Alle angewandten Patches entfernen. -f Erzwungenes Entfernen. Der Zustand vor dem Anwenden das Patches wird über die Sicherungsdateien wiederhergestellt. -R Entfernen über \`patch -R'. Überprüft auch, ob der Ausgangszustand vor dem Anwenden des Patches wieder erreicht wird. -q Wenige Meldungen ausgeben. -v Viele Meldungen ausgeben.
fr: Retire un ou plusieurs patches de la pile. Il est possible de donner en argument un nombre de patch à retirer ou un nom de patch. Dans ce dernier cas, tous les patches placés au dessus du patch à retirer seront retirés eux aussi. Si aucun argument n'est spécifié, le patch au sommet est retiré. -a Retire tous les patches de la série. -f Force l'action. L'état des patches avant qu'ils ne soient retirés sera restoré depuis les fichiers de sauvegarde. -R Retire le patche avec \`patch -R' et vérifie que cela retire proprement tous les changements. -q Opère silencieusement. -v Opère verbeusement.

source: Patch $stop_at_patch is not applied.
de: Patch $stop_at_patch ist nicht angewandt.
fr: Le patch $stop_at_patch n'est pas appliqué.

source: No patch removed
de: Kein Patch entfernt
fr: Aucun patch retiré

source: Interrupted by user
de: Unterbrechung durch Benutzer
fr: Interrompu par l'utilisateur

source: No patches applied
de: Keine Patches angewandt
fr: Aucun patch n'est appliqué

source: Now at patch $patch
de: Jetzt in Patch $patch
fr: Le patch $patch est maintenant au sommet

source: Print the name of the previous patch before the specified or topmost patch in the series file. -n Print patch file names instead of patch names.
de: Gibt den Namen des Patches vor dem obersten oder angegebenen Patch in der series-Datei aus. -n Patch-Dateinamen statt Patch-Namen ausgeben.
fr: Affiche le nom du patch avant celui spécifié (ou après celui au sommet) dans le fichier de série. -n Affiche le nom de fichier au lieu du nom de patch.

source: Usage: quilt push [-afqv] [--leave-rejects] [num|patch]
de: Verwendung: quilt push [-afqv] [--leave-rejects] [num|patch]

source: Patch $stop_at_patch not found in file series
de: Patch $stop_at_patch in series-Datei nicht gefunden
fr: Le patch $stop_at_patch est introuvable dans le fichier de série

source: Patch $stop_at_patch is already applied.
de: Patch $stop_at_patch ist bereits angewandt.
fr: Le patch $stop_at_patch est déjà appliqué.

source: File series fully applied, ends at patch $top
de: series-Datei vollständig angewandt, endet in Patch $top
fr: La série est complètement appliquée. Le dernier patch est $top.

source: Usage: quilt refresh [-p n] [-f] [patch]
de: Verwendung: quilt refresh [-p n] [-f] [patch]

source: Refreshes the specified patch, or the topmost patch by default. Documentation that comes before the actual patch in the patch file is retained. It is possible to refresh patches that are not on top. If any patches on top of the patch to refresh modify the same files, the script aborts by default. Patches can still be refreshed with -f. In that case this script will print a warning for each shadowed file, changes by more recent patches will be ignored, and only changes in files that have not been modified by any more recent patches will end up in the specified patch. -p n Create a -p n style patch (-p0 or -p1 supported). -f Force refresh, even if more recent patches modify some of the same files.
de: Frischt den obersten oder angegebenen Patch auf. Dokumentation in der Patch-Datei, die vor dem eigentlichen Patch steht, bleibt dabei erhalten. Es können beliebige angewandte Patches aufgefrischt werden. Wenn Patches, die nach dem angegebenen Patch angewandt sind, dieselben Dateien verändern, die auch dieser Patch verändert, bricht dieses Script normalerweise ab. Mit der Option -f kann das Auffrischen trotzdem erzwungen werden. Dann wird für jede Datei, die später noch verändert wurde, eine Warnung ausgegeben, und nur Änderungen in Dateien, die danach nicht von anderen Patches weiter verändert werden, werden beim Auffrischen berücksichtigt. -p n Erzeugt einen -p n Patch (n=0 oder n=1 werden unterstützt). -f Auffrischen erzwingen, selbst wenn Patches über dem angegebenen Patch einige der selben Dateien verändern.
fr: Rafraîchit un patch appliqué. Si aucun patch n'est spécifié, il s'agit de celui au sommet. La documentation au début du patch est conservée. Il est possible de rafraîchir un patch ne se trouvant pas au sommet. Dans ce cas et si un autre patch placé plus haut modifie les mêmes fichiers, ce script affiche ces patches conflictuels, ainsi que le nom du fichier sur lequel porte le conflit. Même en cas de conflit, il est possible de rafraîchir le patch en utilisant l'option -f. Le script affichera alors un message d'avertissement pour chaque fichier masqué de la sorte, et ignorera tout changement à ces fichiers. -p n Crée un patch du style -p n (-p0 ou -p1) -f Force le rafraîchissement, même si des patches plus haut changent les mêmes fichiers.

source: Cannot refresh patches with -p$opt_strip_level, please specify -p0 or -p1 instead
de: Kann Patches mit Level -p$opt_strip_level nicht auffrischen, bitte -p0 oder -p1 angeben
fr: Impossible de rafraîchir des patchs avec -p$opt_strip_level. Veuillez spécifier -p0 ou -p1 à la place.

source: More recent patches modify files in $patch. Enforce refresh with -f.
de: Später angewandte Patches verändern Dateien von $patch. Auffrischen mit -f erzwingen.
fr: Des fichiers plus récents modifient les mêmes fichiers que $patch. Forcez le rafraîchissement avec -f.

source: Nothing in patch $patch
de: Patch $patch is leer
fr: Le patch $patch ne contient rien

source: Refreshed patch $patch
de: Patch $patch aufgefrischt.
fr: Le patch $patch a été rafraichi.

source: Usage: quilt remove [-p patch] {file} ...
de: Verwendung: quilt remove [-p patch] {datei} ...
fr: Usage : quilt remove [-p patch] {fichier} ...

source: Remove one or more files from the topmost or named patch. Files that are modified by patches on top of the specified patch cannot be removed. -p patch Patch to remove files from.
de: Entfernt Dateien aus dem obersten oder angegebenen Patch. Dateien, die durch Patches über dem angegebenen Patch verändert werden, können nicht entfernt werden. -p patch Patch, aus dem Dateien entfernt werden sollen.
fr: Retire un ou plusieurs fichiers du patch au sommet ou du patch spécifié. Des fichiers modifiés par des patches plus haut dans la série ne peuvent pas être retirés. -p patch Patch duquel les fichiers doivent être retirés.

source: File $file is not in patch $patch
de: Datei $file ist nicht in Patch $patch enthalten.
fr: Le fichier $file n'est pas dans le patch $patch.

source: Failed to remove file $file from patch $patch
de: Konnte Datei $file nicht aus Patch $patch entfernen.
fr: Impossible d'enlever le fichier $file du patch $patch.

source: File $file removed from patch $patch
de: Datei $file aus Patch $patch entfernt.
fr: Le fichier $file a été enlevé du patch $patch.

source: Usage: quilt series [-v]
de: Verwendung: quilt series [-v]

source: Print the names of all patches in the series file. -n Print patch file names instead patch names. -v Verbose, more user friendly output.
de: Gibt die Namen aller Dateien in der series-Datei aus. -n Patch-Dateinamen statt Patch-Namen ausgeben. -v Ausführlichere, benutzerfreundliche Ausgabe.
fr: Affiche le nom de tous les patches de la série. -n Affiche les noms de fichier au lieu des noms de patch. -v Affichage verbeux, plus simple à lire.

source: Usage: quilt setup [-d sourcedir] {seriesfile|specfile}
de: Verwendung: quilt setup [-d quellvz.] {seriesdatei|specdatei}
fr: Usage : quilt setup [-d répertoire_source] {fichier_séries|fichier_spec}

source: Initializes a source tree from a patch series file. The patch series file must contain the name of the relevant tar archive, in addition to the list of patches.
de: Baut einen Quellen-Baum aus einer series-Datei auf. Die series-Datei muß neben der Liste der Patches auch den Namen der entsprechenden Tar-Datei enthalten.
fr: Initialise une arborescence source depuis un fichier de série. Ce fichier doit contenir le nom de l'archive tar à utiliser, ainsi que la liste des patches.

source: Series file $series_file not found
de: Seriendatei $series_file nicht gefunden
fr: Fichier de série $series_file introuvable

source: Directory $packagedir set up.
de: Verzeichnis $packagedir aufgebaut.
fr: Le répertoire $packagedir est configuré.

source: Usage: quilt top
de: Verwendung: quilt top

source: Print the name of the topmost patch on the current stack of applied patches.
de: Gibt den Namen des obersten Patches auf dem Stapel aus.
fr: Affiche le nom du patch au sommet de la pile des patches actuellement appliqués.

source: Usage: quilt unapplied [patch]
de: Verwendung: quilt unapplied [patch]

source: Print a list of patches that are not applied, or all patches that follow the specified patch in the series file. -n Print patch file names instead of patch names.
de: Gint eine Liste der Patches aus, die momentan nicht angewandt sind, bzw. eine Liste der Patches, die dem angegebenen Patch folgen. -n Patch-Dateinamen statt Patch-Namen ausgeben.
fr: Affiche la liste de tous les patches non appliqués, ou de tous les patches suivant celui indiqué en paramètre. -n Affiche les noms de fichier au lieu des noms de patch.

source: Usage: $0 [-fqv] patchname
de: Verwendung: $0 [-fqv] patchname

source: Interrupted by user; patch $patch was not applied.
de: Unterbrechung durch Benutzer; Patch $patch wurde nicht angewandt.
fr: Interrompu par l'utilisateur ; le patch $patch n'a pas été appliqué.

source: Patch file $patch_file appears to be empty
de: Patch-Datei $patch_file scheint leer zu sein
fr: Le fichier de patch $patch_file semble vide

source: refresh_file_list failed
de: Fehler in refresh_file_list
fr: refresh_file_list a échoué.

source: Applying $patch
de: Anwenden von $patch
fr: Application de $patch

source: Patch $patch appears to be empty, applied
de: Patch $patch scheint leer zu sein, angewandt
fr: Le patch $patch semble vide. Il a été appliqué.

source: Recreated file list for $patch
de: Dateiliste für $patch aktualisiert
fr: La liste des fichiers pour $patch a été recrée.

source: Applied $patch (forced; needs refresh)
de: Patch $patch angewandt (erzwungen, muß aufgefrischt werden (Refresh))
fr: $patch a été appliqué (forcé ; vous devriez le rafraîchir)

source: Patch $patch does not apply (enforce with -f)
de: Patch $patch läßt sich nicht anwenden (erzwingen mit -f)
fr: Le patch $patch ne s'applique pas proprement (forcez l'application avec -f)

source: The topmost patch $top needs to be refreshed first.
de: Der oberste Patch $top muss zuerst aufgefrischt werden (Refresh).
fr: Le patch au sommet $top doit être rafraichi au préalable.

source: Usage: $0 [-fRq] patchname
de: Verwendung: $0 [-fRq] patchname
fr: Usage: $0 [-fRq] nom_de_patch

source: Patch does not remove changes:
de: Patch entfernt folgende Änderungen nicht:
fr: Le patch d'enlève pas les changements :

source: Interrupted by user; patch $patch was not removed.
de: Unterbrechung durch Benutzer; Patch $patch wurde nicht entfernt.
fr: Interrompu par l'utilisateur ; le patch $patch n'a pas été retiré;

source: Patch $patch appears to be empty, removed
de: Patch $patch scheint leer zu sein, entfernt
fr: Le patch $patch semble vide. Il a été retiré.
